[
    {
        "info":"Niranjan Swamy N is founder and CEO at medapp.in BEHANDELN MEDCARE SOLUTIONS PVT LTD. medapp.in founded in 2015 has grown to be one of the fastest growing outsourcing healthcare service providers focused on delivering quality centric services to the Indian health care providers. Having said with an Objective of One point solution for all diagnostic services, our motivation towards Quality and Efficiency to improve lives of patients, with a strategic focal point of Disease Prevention and health promotion, and added strength like improved health outcomes and high level of efficiency, carried out with our values of user satisfaction. A result oriented professional with 12 years’ extensive experience in Disease Management and Patient Support Programme. Trained close to five thousand Nurses and paramedics till date and actively participates in health promotion activities."
    },
    {
        "info":"Dr.Vinod singh, as Chief operations Officer, is responsible for the operations of various projects at Medapp. He along with the operations team completes the requirement of identifying and managing various resources required for the smooth operations. Dr.Vinod singh has nearly a decade of experience in healthcare industry with a strong track record of driving consulting business and executing many hospital projects. Earlier, Dr.Vinod singh was also a Founder and consultant at Hospitech healthcare consulting where he held the profile of a healthcare Business consultant for over 7 years. He was responsible for overseeing the healthcare consulting business in India and abroad. He was also the author or various articles in healthcare magazines over the years and a regular speaker at various conferences and healthcare exhibitions. Prior to this, Dr.Vinod singh was also a Manager of FACC (Fraud and Abuse control of claims) at MD India healthcare TPA services as well as worked at a Healthcare IT firm for implementation of HMIS in hospitals for a brief period. He holds a Masters in healthcare management and a Bachelor of Dental surgery from Rajiv Gandhi University of health sciences, Bangalore."
    },
    {
        "info":"Sinu George is a Director of the board at medapp.in . She is a master degree holder in Nursing education and administration. She served as a faculty member in a nursing college and shares knowledge and skills to prepare the next generation of nurses for effective practice and develop teaching courses evaluated educational programmes. With her experience, advanced to administrative roles such as managing nursing education programmes and developing continuing education programme for working nurses. She has conducted continuing nursing education programe in several hospital in various parts of India trained more than 5000 nursing staff on topic like congestive heart failure, diabetes mellitus etc. In 2004, she completed CGFNS exam (Philadelphia board, USA) In 2008, she cleared NCLEX-RN(Florida board, USA) An exam one takes to receive nursing license to work in US and Canada. In 2012 -2013 she worked for Accenture in a voice process for a health care domain. And with hard working passionate young team comprising individuals both from health and non-health sectors, it’s no surprise that medapp in such a successful and fast growing company in health care industry. It’s her goal to drive our company forward by finding the best and brightest nursing staff to join our team and give continuing education to improve their knowledge in various aspects of nursing service such as nursing practice counselling the patients etc."
    },
    {
        "info":"Krishna Raghavan serves as a director in Medapp which is crafted in providing premium health care services. A serial entrepreneur by nature, krishna founded medapp along with Niranjan in the year 2015. With his widespread network in the pharma industry, Krishna plays a key role in acquiring fresh businesses for the company. Krishna strongly feels that a market is not simply taken over, it is created, nurtured and made to thrive. As medapp cultivates its market, they look forward to solving new challenges in the coming years in the space of Disease Management. Simultaneously, he is also the Dy CEO of Astute Advisors India, which is a financial services company specialising in secondary market products and services and pre ipo stocks. His deep understanding of the financial services industry and with his decade experience across wide spectrum and also his ability to arrive at accurate valuations has always been of significant value to clients. Krishna deserves the credit for pioneering the secondary business in India and for being instrumental in making astute advisors the single largest dealer of secondary products in PE and RE funds. He also serves as the Dy CEO of Unlistedkart which is known for its acute valuations of Unlisted stocks."
    },
    {
        "info":"Dr. Shiraz Nisar is the Chief Medical Officer (CMO) of medapp. He is responsible for providing a vision, strategic business planning, as well as quality control and maintenance. Dr. Nisar is an asset to medapp and has been very instrumental in integrating american standards to Medapp and quality control. Dr. Nisar was born &amp; lives in USA. He attended medical school at J.S.S Medical college in Mysore, India. He returned to USA and completed his residency in Internal Medicine. Subsequently he moved to Ohio as a Staff Hospitalist in the prestigious Heart and Vascular Institute of the Cleveland Clinic. The Heart and Vascular Institute was ranked #1 in heart care during his tenure at the Cleveland Clinic. As a result of his achievements in providing high value care by working on high quality low cost initiatives, he was offered a leadership role as Director of Hospital Medicine at University Hospitals, Ahuja Medical Center. He progressed onto becoming Chairman, Dept of Medicine, at the same facility for the maximum two term limit. During this time, he also joined the Clinical Effective Team for the Department of Medicine for the University Hospital health system, and now chairs the group. He has played a prominent role in patient safety and clinical efficiency at the facilities in which he has worked. He is a “TeamStepps certified master trainer” and “Lean Six Sigma” certified. Tools he feels have been invaluable in advancing healthcare. He continues to provide hospital medicine services in the Cleveland region in collaboration with HNI healthcare."
    }
]